https://www.youtube.com/watch?v=zmdjNSmRXF4&list=PL-osiE80TeTsWmV9i9c58mdDCSskIFdDS&index=2

In [1]:
import pandas as pd

# Creating a practice table using a dictionary

In [14]:
table = {
    'first': ['Craig', 'Samantha', 'Fran'],
    'last': ['Lewis', 'Pitridge', 'Boober'],
    'email': ['bullboi@something.com', 'rex@aol.com', 'bigjuiceytitties@penis.com']
}

# turning the dictionary into a dataframe

In [15]:
df = pd.DataFrame(table)

In [22]:
df

      first      last                       email
0     Craig     Lewis       bullboi@something.com
1  Samantha  Pitridge                 rex@aol.com
2      Fran    Boober  bigjuiceytitties@penis.com

# accessing columns

In [16]:
df['email']

0         bullboi@something.com
1                   rex@aol.com
2    bigjuiceytitties@penis.com
Name: email, dtype: object

In [17]:
type(df['email'])

pandas.core.series.Series

In [18]:
df.columns

Index(['first', 'last', 'email'], dtype='object')

# iloc - accessing rows by integer (index)

In [19]:
df.iloc[0]

first                    Craig
last                     Lewis
email    bullboi@something.com
Name: 0, dtype: object

In [20]:
df.iloc[[0, 1]]

      first      last                  email
0     Craig     Lewis  bullboi@something.com
1  Samantha  Pitridge            rex@aol.com

In [21]:
df.iloc[[0, 1], 2]

0    bullboi@something.com
1              rex@aol.com
Name: email, dtype: object

In [26]:
df.iloc[[0, 1], [2, 1]]

                   email      last
0  bullboi@something.com     Lewis
1            rex@aol.com  Pitridge

# loc - accessing rows by label

In [23]:
df.loc[[0, 1], 'email']

0    bullboi@something.com
1              rex@aol.com
Name: email, dtype: object

In [25]:
df.loc[[0, 1], ['email', 'last']]

                   email      last
0  bullboi@something.com     Lewis
1            rex@aol.com  Pitridge